{
    "educations": [
        {
            "id": "edu-1",
            "school": "Lampang Rajabhat University",
            "degree": "Information Technology",
            "duration": "Aug 2016 - Mar 2020",
            "content": [
                "GPA: 3.36",
                "Courses: Data Structures, OOP, Algorithms, Software Engineering, Computer Networks, Artificial Intelligence"
            ]
        },
        {
            "id": "edu-2",
            "school": "Lampangpoly",
            "degree": "Electronics",
            "duration": "May 2013 - Apr 2016",
            "content": ["GPA: 3.63", "Courses: Digital Electronics, Microprocessor"]
        }
    ],
    "experiences": [
        {
            "id": "exp-1",
            "company": "Infinity Code Co., Ltd",
            "position": "Full Stack Developer",
            "duration": "Sep 2022 - Present",
            "description": [
                "Spearheading the development of a highly scalable web application using Node.js and Nuxt.js, delivering robust front-end and back-end solutions that enhance overall system performance and user engagement.",
                "Implementing server-side logic in Golang to handle high-throughput data processing, significantly improving application efficiency and reducing response times.",
                "Leading the integration of a RESTful API architecture, ensuring seamless communication between front-end and back-end systems, and facilitating efficient data exchange.",
                "Collaborating in the design and implementation of a microservices architecture, leveraging Golang's concurrency model to handle multiple service requests simultaneously.",
                "Championing the development of responsive and intuitive user interfaces with Nuxt.js, enhancing user interaction and providing a seamless experience across various devices and platforms.",
                "Actively involved in database design and management, employing best practices in data modeling and storage to optimize application performance and scalability.",
                "Ensuring code quality and maintainability by adopting agile methodologies, conducting thorough code reviews, and implementing automated testing frameworks.",
                "Playing a crucial role in continuous integration and deployment processes, utilizing modern DevOps tools to streamline and automate application updates and deployments."
            ]
        },
        {
            "id": "exp-2",
            "company": "Paiduaykanmai Co., Ltd",
            "position": "Mid-level Backend Developer",
            "duration": "Apr 2022- Aug 2022",
            "description": [
                "Engineered a real-time data processing pipeline that efficiently handled streaming data, ensuring timely and accurate updates for end-users in research and medical fields.",
                "Collaborated closely with front-end developers to integrate the backend systems with dynamic web interfaces, ensuring seamless data flow and interaction.",
                "Conducted thorough usability testing and user feedback sessions, leading to the development of more intuitive and responsive user interfaces, which enhanced the overall user experience.",
                "Played a key role in optimizing database queries and server responses, resulting in a 40% improvement in application response times and data retrieval efficiency."
            ]
        },
        {
            "id": "exp-3",
            "company": "Infinity Code Co., Ltd",
            "position": "Junior Backend Developer",
            "duration": "Dec 2020 - Mar 2022",
            "description": [
                "Spearheaded the development of a robust API for a dynamic web application, enhancing data handling and server-side functionalities. This effort significantly improved backend efficiency and user experience.",
                "Assisted in optimizing server load balancing and resource management, resulting in smoother application performance and a 30% reduction in server downtime.",
                "Participated in the continuous improvement of backend systems by introducing modern development practices and technologies, contributing to the overall scalability and maintainability of the projects."
            ]
        }
    ],
    "skills": [
        {
            "title": "Programming",
            "tools": ["TypeScript", "JavaScript", "Golang", "NoSQL", "SQL"]
        },
        {
            "title": "Web",
            "tools": ["React", "Vue", "NodeJS", "Golang", "HTML/CSS", "OAuth", "i18n"]
        },
        {
            "title": "Databases",
            "tools": ["MongoDB", "Redis", "PostgreSQL", "Firebase"]
        },

        {
            "title": "OS & Tools",
            "tools": ["MacOS", "Git", "Agile (Scrum)", "Heroku", "Docker"]
        }
    ]
}
