{
    "educations": [
        {
            "id": "edu-1",
            "school": "Lampang Rajabhat University",
            "degree": "Information Technology",
            "duration": "Aug 2016 - Mar 2020",
            "content": [
                "GPA: 3.36",
                "Courses: Data Structures, OOP, Algorithms, Software Engineering, Computer Networks, Artificial Intelligence"
            ]
        },
        {
            "id": "edu-2",
            "school": "Lampangpoly",
            "degree": "Electronics",
            "duration": "May 2013 - Apr 2016",
            "content": ["GPA: 3.63", "Courses: Digital Electronics, Microprocessor"]
        }
    ],
    "experiences": [
        {
            "id": "exp-1",
            "company": "Infinity Code Co., Ltd",
            "position": "Full Stack Developer",
            "duration": "Sep 2022 - Present",
            "description": [
                "Leading scalable web app development with Node.js and Nuxt.js to improve performance and engagement.",
                "Developing Golang server logic for efficient data processing and quick responses.",
                "Spearheading seamless integration of RESTful APIs for effective front-end to back-end communication.",
                "Driving development of intuitive, responsive interfaces with Nuxt.js for uniform multi-device experiences.",
                "Involved in database design and management using best practices for performance and scalability.",
                "Ensuring code quality and maintainability with agile methods, thorough reviews, and automated testing.",
                "Key role in CI/CD processes, using DevOps tools for streamlined app updates and deployments."
              ]
        },
        {
            "id": "exp-2",
            "company": "Paiduaykanmai Co., Ltd",
            "position": "Mid-level Backend Developer",
            "duration": "Apr 2022- Aug 2022",
            "description": [
                "Developed a real-time data pipeline for efficient stream processing, guaranteeing up-to-date and precise information for users in research and healthcare.",
                "Worked closely with front-end teams to merge backend systems with interactive web interfaces for fluid data integration and user interaction.",
                "Performed extensive usability tests and user feedback rounds, creating more intuitive and agile interfaces, improving user experience.",
                "Crucial in database and server optimization, achieving a 40% boost in app responsiveness and data access speed."
              ]
        },
        {
            "id": "exp-3",
            "company": "Infinity Code Co., Ltd",
            "position": "Junior Backend Developer",
            "duration": "Dec 2020 - Mar 2022",
            "description": [
                "Led the development of a high-performance API for a dynamic web app, improving data management and backend functionality, which enhanced efficiency and user experience.",
                "Contributed to server load optimization and resource allocation, achieving smoother performance and reducing server downtime by 30%.",
                "Engaged in backend enhancements by adopting cutting-edge development methods and tech, enhancing project scalability and maintainability."
              ]
        }
    ],
    "skills": [
        {
            "title": "Programming",
            "tools": ["TypeScript", "JavaScript", "Golang", "NoSQL", "SQL"]
        },
        {
            "title": "Web",
            "tools": ["React", "Vue", "NodeJS", "Golang", "HTML/CSS", "OAuth", "i18n"]
        },
        {
            "title": "Databases",
            "tools": ["MongoDB", "Redis", "PostgreSQL", "Firebase"]
        },

        {
            "title": "OS & Tools",
            "tools": ["MacOS", "Git", "Agile (Scrum)", "Heroku", "Docker"]
        }
    ]
}
